---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wave.WaveWaveRadius
source: html/216a0a9b-4d2b-1323-9b4b-24db29f6fad4.htm
---
# Autodesk.Revit.DB.Visual.Wave.WaveWaveRadius Property

The property labeled "Radius" from the "Wave" schema.

## Syntax (C#)
```csharp
public static string WaveWaveRadius { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".